## LAB - S07-L002 - metody append i concat

1. Zaimportuj moduł pandas i numpy nadaj im standardowe aliasy
2. Do zmiennej mrbean zaimportuj zawartość pliku mrbean_facebook_statuses_join.csv. Pobierz tylko kolumny 'status_message_mrbean','status_type','num_likes'. To dane dotyczące statusów Jasia Fasoli (może znasz z TV ;))
3. Do zmiennej nasa zaimportuj zawartość pliku nasa_facebook_statuses_join.csv. Pobierz tylko kolumny 'status_message_nasa','status_type','num_likes'. To dane dotyczące statusów NASA
4. Wyświetl nagłówki obu zmiennych
5. Do zmiennej fb zapisz wynik komendy append, która połączy dane z mrbean i z nasa (łącząc dane w tym i następnych poleceniach korzystaj z parametru sort=True)
6. Wyświetl początkowe i ostatnie wiersze fb. Zwróć uwagę na kolumny status_message_mrbean i status_message_nasa
7. Wyświetl wiersze fb, które mają indeks 0. (Powinieneś zobaczyć 2 wiersze)
8. Zmień polecenie z kroku 5, tak aby obiekt fb miał wygenerowany nowy indeks
9. Wyświetl wiersze fb, które mają indeks 0. Teraz powinien się znaleźć tylko jeden wiersz o indeksie 0
10. Zmień nazwę kolumny status_message_mrbean w data frame mrbean na status_message. Podobnie w data frame nasa zmień nazwę kolumny status_message_nasa na status_message.
11. Wykonaj ponownie połaczenie z kroku 8. Potem wyświetl zmienną fb. Zauważ, że istnieje już tylko jedna kolumna z status_message.
12. Zmień poprzednie polecenie tak, aby korzystało z polecenia concat zamiast append

In [1]:
import pandas as pd
import numpy as np

In [2]:
mrbean = pd.read_csv('../zasoby/mrbean_facebook_statuses_join.csv', usecols=['status_message_mrbean','status_type','num_likes'])

In [4]:
nasa = pd.read_csv('../zasoby/nasa_facebook_statuses_join.csv', usecols=['status_message_nasa','status_type','num_likes'])

In [5]:
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [6]:
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [8]:
fb = pd.concat(objs=[mrbean, nasa], sort=True)

In [9]:
fb.head()

,status_message_mrbean,status_type,num_likes,status_message_nasa
0,It's time for Mr Bean and Teddy to get ready f...,video,16079,NaN
1,NaN,photo,114008,NaN
2,NaN,photo,218579,NaN
3,Mr Bean is ready to do some shopping but bewar...,video,20338,NaN
4,NaN,photo,215591,NaN

In [11]:
fb.tail()

,status_message_mrbean,status_type,num_likes,status_message_nasa
758,NaN,photo,39355,You've never seen Pluto like this before! New ...
759,NaN,photo,11835,Our cooperative field study in East Asia advan...
760,NaN,photo,15567,"After spending a #YearInSpace, astronaut Scott..."
761,NaN,photo,41584,"Gravitational waves, predicted by Einstein and..."
762,NaN,photo,12793,Have you ever used a GPS to help you get somew...

In [12]:
fb.loc[0]

,status_message_mrbean,status_type,num_likes,status_message_nasa
0,It's time for Mr Bean and Teddy to get ready f...,video,16079,NaN
0,NaN,photo,5142,"This morning, the #RockOn mission with student..."

In [13]:
fb = pd.concat(objs=[mrbean, nasa], sort=True, ignore_index=True)

In [14]:
fb.loc[0]

num_likes                                                            16079
status_message_mrbean    It's time for Mr Bean and Teddy to get ready f...
status_message_nasa                                                    NaN
status_type                                                          video
Name: 0, dtype: object

In [15]:
mrbean.rename(columns={"status_message_mrbean": "status_message"}, inplace=True)

In [16]:
nasa.rename(columns={"status_message_nasa": "status_message"}, inplace=True)

In [17]:
fb = pd.concat(objs=[mrbean, nasa], ignore_index=True, sort=True)

In [18]:
fb.head()

   num_likes                                     status_message status_type
0      16079  It's time for Mr Bean and Teddy to get ready f...       video
1     114008                                                NaN       photo
2     218579                                                NaN       photo
3      20338  Mr Bean is ready to do some shopping but bewar...       video
4     215591                                                NaN       photo